In [1]:
import pandas as pd
import numpy as np
import sqlite3 as sql

In [3]:
database = 'sqlite_db_pythonsqlite.db'
connection = sql.connect(database)

In [6]:
query = 'SELECT name, SUM(membercost + guestcost) AS total_revenue FROM(Facilities INNER JOIN Bookings ON Bookings.facid = Facilities.facid) GROUP BY Facilities.facid HAVING total_revenue < 1000 ORDER BY total_revenue'

In [7]:
df = pd.read_sql_query(query, connection)
df.head()

Empty DataFrame
Columns: [name, total_revenue]
Index: []

In [16]:
query11 = 'SELECT A.surname, A.firstname, B.firstname AS Recommender FROM Members A, Members B WHERE A.recommendedby = B.memid ORDER BY A.surname, A.firstname'

In [17]:
df = pd.read_sql_query(query11, connection)
df.head()

   surname firstname Recommender
0    Bader  Florence      Ponder
1    Baker      Anne      Ponder
2    Baker   Timothy      Jemima
3   Boothe       Tim         Tim
4  Butters    Gerald      Darren

In [19]:
query12 = 'SELECT name, firstname, starttime, slots, COUNT(name) AS BookingsCount FROM ((Facilities INNER JOIN Bookings ON Bookings.facid = Facilities.facid) INNER JOIN Members ON Members.memid = Bookings.memid) WHERE Members.firstname != \'GUEST\' GROUP BY firstname, name ORDER BY Members.memid'

In [20]:
df = pd.read_sql_query(query12, connection)
df.head()

              name firstname            starttime  slots  BookingsCount
0  Badminton Court    Darren  2012-07-05 09:30:00      3            132
1   Massage Room 1    Darren  2012-07-03 08:00:00      2             28
2       Pool Table    Darren  2012-07-03 10:00:00      1             28
3    Snooker Table    Darren  2012-07-03 19:00:00      2             12
4     Squash Court    Darren  2012-07-04 15:30:00      2             14

In [24]:
query13 = 'SELECT name, firstname, strftime(\'%m\', starttime) AS month, COUNT(name) AS BookingsCount FROM ((Facilities INNER JOIN Bookings ON Bookings.facid = Facilities.facid) INNER JOIN Members ON Members.memid = Bookings.memid) WHERE Members.firstname != \'GUEST\' GROUP BY month ORDER BY Members.memid'

In [25]:
df = pd.read_sql_query(query13, connection)
df.head()

             name firstname month  BookingsCount
0    Table Tennis    Darren    07            480
1  Tennis Court 1    Gerald    08           1168
2  Tennis Court 1     David    09           1512